In [1]:
import numpy as np
import pandas as pd

In [2]:
customerAndBank = pd.read_csv(r"C:\Users\akshayd6\Desktop\MyModels\Loan Default Prediction Capstone\Data\Customer and bank.csv",index_col = 'Customer_id')
customerSocialEconomic = pd.read_csv(r"C:\Users\akshayd6\Desktop\MyModels\Loan Default Prediction Capstone\Data\Customer_social_economic_data_p1.csv",index_col = 'Customer_id')
customerCampaign = pd.read_csv(r"C:\Users\akshayd6\Desktop\MyModels\Loan Default Prediction Capstone\Data\Customer campaign details.csv",index_col = 'Customer_id')
customerResponse = pd.read_csv(r"C:\Users\akshayd6\Desktop\MyModels\Loan Default Prediction Capstone\Data\Customer_Response_data_p1.csv",index_col = 'Customer_id')
customerPostalCode = pd.read_csv(r"C:\Users\akshayd6\Desktop\MyModels\Loan Default Prediction Capstone\Data\Customer_Postal_Code_details.csv",index_col = 'Customer_id')
region = pd.read_csv(r"C:\Users\akshayd6\Desktop\MyModels\Loan Default Prediction Capstone\Data\Region_code_master.csv")
state = pd.read_csv(r"C:\Users\akshayd6\Desktop\MyModels\Loan Default Prediction Capstone\Data\State_Master.csv")
city = pd.read_csv(r"C:\Users\akshayd6\Desktop\MyModels\Loan Default Prediction Capstone\Data\City_Master.csv")

In [3]:
#code to display all columns of dataset
pd.set_option('display.max_columns', None)
pd.set_option('display.width', None)
pd.set_option('display.max_colwidth', None)

In [4]:
customerAndBank.head()

,age,job,marital,education,default,housing,loan,Region_Code,State_Code,City_Code
Customer_id,,,,,,,,,,
1,56,services,married,high school,no,no,yes,3,S1,C1
2,45,services,married,basic 9y,unknown,no,no,3,S1,C1
3,59,admin,married,professional course,no,no,no,4,S2,C2
4,41,blue collar,married,unknown,unknown,no,no,3,S3,C3
5,24,technician,single,professional course,no,yes,no,3,S3,C3

In [5]:
customerSocialEconomic.head()

,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed
Customer_id,,,,,
1,1.1,93.994,-36.4,4.857,5191.0
2,1.1,93.994,-36.4,4.857,5191.0
3,1.1,93.994,-36.4,4.857,5191.0
4,1.1,93.994,-36.4,4.857,5191.0
5,1.1,93.994,-36.4,4.857,5191.0

In [6]:
customerCampaign.head()

,contact,Campaign_month,day_of_week,duration,campaign,pdays,previous,poutcome
Customer_id,,,,,,,,
1,telephone,may,mon,307,1,999,0,nonexistent
2,telephone,may,mon,198,1,999,0,nonexistent
3,telephone,may,mon,139,1,999,0,nonexistent
4,telephone,may,mon,217,1,999,0,nonexistent
5,telephone,may,mon,380,1,999,0,nonexistent

In [7]:
customerResponse.head()

              y
Customer_id
1            no
2            no
3            no
4            no
5            no

In [8]:
customerPostalCode.shape

(37084, 1)

In [38]:
region.head()

  Region_Name  Region_Code
0     Central            1
1        East            2
2       South            3
3        West            4
4       North            5

In [10]:
state.head()

  State_Code      State_Name  Region_Code
0         S1        Kentucky            3
1         S2      California            4
2         S3         Florida            3
3         S4  North Carolina            3
4         S5      Washington            4

In [11]:
city.head()

  City_Code        City_Name State_Code
0        C1        Henderson         S1
1        C2      Los Angeles         S2
2        C3  Fort Lauderdale         S3
3        C4          Concord         S4
4        C5          Seattle         S5

>Merge all the datasets that have 'Customer_Id' as a common field

In [12]:
complete_data1 = customerAndBank.copy()

In [13]:
complete_data1 = pd.merge(complete_data1,customerSocialEconomic,on = "Customer_id")

In [14]:
complete_data1 = pd.merge(complete_data1,customerCampaign,on = "Customer_id")

In [15]:
complete_data1 = pd.merge(complete_data1,customerResponse,on = "Customer_id")

In [16]:
complete_data1 = pd.merge(complete_data1,customerPostalCode,on = "Customer_id")

In [17]:
complete_data1.shape

(37084, 25)

In [18]:
complete_data2 = complete_data1.copy()

In [19]:
state.shape[0]

49

### Mapping State Name to "complete_data1" using "state" dataset.

In [20]:
complete_data1['State_Name'] = 'X'

In [21]:
for i in range(0,complete_data1.shape[0]):
    for j in range(0,state.shape[0]):
        if complete_data1['State_Code'].iloc[i] == state['State_Code'].iloc[j]:
            complete_data1['State_Name'].iloc[i] = state['State_Name'].iloc[j]
        else:
            continue

C:\Users\akshayd6\AppData\Local\Temp\ipykernel_18064\1430501260.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  complete_data1['State_Name'].iloc[i] = state['State_Name'].iloc[j]

In [22]:
complete_data1['State_Name'].value_counts()

California              7427
New York                4212
Texas                   3614
Pennsylvania            2180
Washington              1881
Illinois                1812
Ohio                    1732
Florida                 1410
Michigan                 959
North Carolina           920
Arizona                  844
Virginia                 812
Georgia                  692
Colorado                 681
Tennessee                658
Indiana                  562
Kentucky                 520
Massachusetts            491
New Jersey               479
Oregon                   460
Wisconsin                404
Maryland                 394
Delaware                 353
Minnesota                347
Connecticut              303
Oklahoma                 248
Missouri                 245
Alabama                  235
Arkansas                 230
Utah                     205
Rhode Island             204
Mississippi              199
South Carolina           168
Louisiana                162
New Mexico               140
Nevada                   139
Nebraska                 136
Iowa                     109
New Hampshire            102
Kansas                    91
Idaho                     78
Montana                   55
South Dakota              45
District of Columbia      40
Vermont                   35
Maine                     29
North Dakota              26
West Virginia             12
Wyoming                    4
Name: State_Name, dtype: int64

### Mapping City Name to "complete_data1" using "city" dataset.

In [23]:
complete_data1["City_Name"] = 'X'

In [24]:
for i in range(0,complete_data1.shape[0]):
    for j in range(0,city.shape[0]):
        if complete_data1['City_Code'].iloc[i] == city['City_Code'].iloc[j]:
            complete_data1['City_Name'].iloc[i] = city['City_Name'].iloc[j]
        else:
            continue

C:\Users\akshayd6\AppData\Local\Temp\ipykernel_18064\3979376953.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  complete_data1['City_Name'].iloc[i] = city['City_Name'].iloc[j]

In [25]:
complete_data1['City_Name'].value_counts()

New York City        3422
Los Angeles          2781
Philadelphia         1996
San Francisco        1906
Seattle              1590
                     ...
Davis                   3
Arlington Heights       3
San Luis Obispo         3
Springdale              3
Danbury                 3
Name: City_Name, Length: 531, dtype: int64

### Mapping Region Name to "complete_data1" using "region" dataset.

In [26]:
np.dtype(complete_data1['Region_Code'])

dtype('O')

In [27]:
np.dtype(region['Region_Code'])

dtype('int64')

>There was a datatype mismatch in 'Region_Code' between the datasets. So the datatype has to be changed in order to map the region name.

In [28]:
complete_data1['Region_Code'].value_counts()

4     11884
2     10558
1      8590
3      5992
Na       60
Name: Region_Code, dtype: int64

>It was observed that "Na" is present as a string and all other values are numbers. So this has to assigned a random number(999) in order to convert the ebtire column to integer type.

In [29]:
for i in range(0,complete_data1.shape[0]):
    if complete_data1['Region_Code'].iloc[i] == 'Na':
        #assigning 999 to 'Na'
        complete_data1['Region_Code'].iloc[i] = 999

C:\Users\akshayd6\AppData\Local\Temp\ipykernel_18064\3330460539.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  complete_data1['Region_Code'].iloc[i] = 999

In [41]:
complete_data1['Region_Code'] = complete_data1['Region_Code'].astype(int)

In [42]:
np.dtype(complete_data1['Region_Code'])

dtype('int32')

In [32]:
complete_data2['Region_Code'].value_counts()

4     11884
2     10558
1      8590
3      5992
Na       60
Name: Region_Code, dtype: int64

In [33]:
complete_data1['Region_Name'] = 'X'

In [43]:
#mapping region name to complete
for i in range(0,complete_data1.shape[0]):
    for j in range(0,region.shape[0]):
        if complete_data1['Region_Code'].iloc[i] == region['Region_Code'].iloc[j]:
            complete_data1['Region_Name'].iloc[i] = region['Region_Name'].iloc[j]
        else:
            continue

C:\Users\akshayd6\AppData\Local\Temp\ipykernel_18064\2632736004.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  complete_data1['Region_Name'].iloc[i] = region['Region_Name'].iloc[j]

In [44]:
complete_data1['Region_Name'].value_counts()

West       11884
East       10558
Central     8590
South       5992
X             60
Name: Region_Name, dtype: int64

### Complete Data

In [45]:
complete_data1.head()

,age,job,marital,education,default,housing,loan,Region_Code,State_Code,City_Code,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,contact,Campaign_month,day_of_week,duration,campaign,pdays,previous,poutcome,y,Postal Code,State_Name,City_Name,Region_Name
Customer_id,,,,,,,,,,,,,,,,,,,,,,,,,,,,
1,56,services,married,high school,no,no,yes,3,S1,C1,1.1,93.994,-36.4,4.857,5191.0,telephone,may,mon,307,1,999,0,nonexistent,no,42420,Kentucky,Henderson,South
2,45,services,married,basic 9y,unknown,no,no,3,S1,C1,1.1,93.994,-36.4,4.857,5191.0,telephone,may,mon,198,1,999,0,nonexistent,no,42420,Kentucky,Henderson,South
3,59,admin,married,professional course,no,no,no,4,S2,C2,1.1,93.994,-36.4,4.857,5191.0,telephone,may,mon,139,1,999,0,nonexistent,no,90036,California,Los Angeles,West
4,41,blue collar,married,unknown,unknown,no,no,3,S3,C3,1.1,93.994,-36.4,4.857,5191.0,telephone,may,mon,217,1,999,0,nonexistent,no,33311,Florida,Fort Lauderdale,South
5,24,technician,single,professional course,no,yes,no,3,S3,C3,1.1,93.994,-36.4,4.857,5191.0,telephone,may,mon,380,1,999,0,nonexistent,no,33311,Florida,Fort Lauderdale,South

>Removing reduntant columns

In [48]:
complete_data1.drop(['City_Code','State_Code','Region_Code'],inplace = True,axis = 1)

>Cleaning up column names

In [53]:
complete_data1.rename(columns = {'emp.var.rate':'employee_variation_rate','cons.price.idx':'consumer_price_index','euribor3m':'euribor',
         'nr.employed':'number_employed'},inplace = True)

### Final Dataset

In [54]:
complete_data1.head()

,age,job,marital,education,default,housing,loan,employee_variation_rate,consumer_price_index,cons.conf.idx,euribor,number_employed,contact,Campaign_month,day_of_week,duration,campaign,pdays,previous,poutcome,y,Postal Code,State_Name,City_Name,Region_Name
Customer_id,,,,,,,,,,,,,,,,,,,,,,,,,
1,56,services,married,high school,no,no,yes,1.1,93.994,-36.4,4.857,5191.0,telephone,may,mon,307,1,999,0,nonexistent,no,42420,Kentucky,Henderson,South
2,45,services,married,basic 9y,unknown,no,no,1.1,93.994,-36.4,4.857,5191.0,telephone,may,mon,198,1,999,0,nonexistent,no,42420,Kentucky,Henderson,South
3,59,admin,married,professional course,no,no,no,1.1,93.994,-36.4,4.857,5191.0,telephone,may,mon,139,1,999,0,nonexistent,no,90036,California,Los Angeles,West
4,41,blue collar,married,unknown,unknown,no,no,1.1,93.994,-36.4,4.857,5191.0,telephone,may,mon,217,1,999,0,nonexistent,no,33311,Florida,Fort Lauderdale,South
5,24,technician,single,professional course,no,yes,no,1.1,93.994,-36.4,4.857,5191.0,telephone,may,mon,380,1,999,0,nonexistent,no,33311,Florida,Fort Lauderdale,South

### Exporting Final dataset

In [56]:
complete_data1.to_csv("Final Dataset.csv")